#include <iostream>
using namespace std;

int main() {
    // === Ввод данных ===
    // cin >> переменная;

    int num;
    cout << "Enter a number: ";
    cin >> num;

    cout << "Вы ввели число: " << num << '\n';

    // === Операторы ===
    float num_1, num_2;
    cin >> num_1 >> num_2;

    // --- Математические ---
    cout << "Сложение: " << num_1 << " + " << num_2 << " = " << num_1 + num_2 << '\n';
    cout << "Вычитание: " << num_1 << " - " << num_2 << " = " << num_1 - num_2 << '\n';
    cout << "Умножение: " << num_1 << " * " << num_2 << " = " << num_1 * num_2 << '\n';
    cout << "Деление: " << num_1 << " / " << num_2 << " = " << num_1 / num_2 << '\n';
    cout << "Остаток от деления: " << num_1 << " % " << num_2 << " = " << int(num_1) % int(num_2) << '\n';

    // --- Сравнения ---
    cout << "\nБольше: " << num_1 << " > " << num_2 << " = " << (num_1 > num_2) << '\n';
    cout << "Меньше: " << num_1 << " < " << num_2 << " = " << (num_1 < num_2) << '\n';
    cout << "Равенство: " << num_1 << " == " << num_2 << " = " << (num_1 == num_2) << '\n';
    cout << "Больше или равно: " << num_1 << " >= " << num_2 << " = " << (num_1 >= num_2) << '\n';
    cout << "Меньше или равно: " << num_1 << " <= " << num_2 << " = " << (num_1 <= num_2) << '\n';
    cout << "Неравенство: " << num_1 << " != " << num_2 << " = " << (num_1 != num_2) << '\n';

    // --- Логические ---
    int x = 6;

    // И (&&)
    // число в диапазоне от 5 до 10
    cout << ((x > 5) && (x < 10)) << '\n';

    // ИЛИ (||)
    // число вне диапазона от 5 до 10
    cout << ((x < 5) || (x > 10)) << '\n';

    // НЕ (!)
    bool is_alive = true;
    cout << !is_alive << '\n'; // false

    return 0;
}