# Переменные
# имя = значение
x = 12 # number - числовой тип
message = 'Привет'  # string - строковый тип
isOpen = True # bool - логический тип (True / False)

# Ввод / вывод
print()
print('Hello world!')

# Интерполяция - внедрение переменных в строку
print(f'Hello {message}, сегодня я покушал {x} пельменей')

z = input('Введите число: ')

# преобразование ввода в числовой тип
num1 = int(input('Введите число: ')) 

# преобразование ввода в строковый тип
str1 = str(input('Введите строку: '))

# Арифметика
'+ - * / ** // %'

# Сравнение
'> < >= <= == !='






