# while
# for

# while условие:
#   действия, выполняются пока условие = True
# else:
#   действия, выполнятся когда условие станет False

# num = 1
# while num <= 10:
#     print(num)
#     num = num + 1
# else:
#     print('Цикл завершен')

# for переменная in множество:
#   действия над переменной
# else:
#   действия, когда цикл дойдет до конца множества

range(5) # от 0 до 4
range(10, 100) # от 10 до 99
range(10, 50, 3) # от 10 до 49 с шагом 3

num53 = 0
for x in range(5):
    print(num53)
    