# if условие:
    # код, выполняется если условие True
# else:
    # код, выполняется если условие False

# Пример, проверка возраста
# age = int(input('Введите ваш возраст: '))

# if age >= 18:
#     print('Вы совершеннолетний')
# else:
#     print('Вы мелкий')

# if условие1:
#     код, выполняется если условие1 True
# elif условие2:
#     код, выполняется если условие2 True
# else:
#     код, выполняется если все условия False   

# num1 = int(input('Введите первое число: '))
# num2 = int(input('Введите второе число: '))

# if num1 > num2:
#     print(f'{num1} больше')
# elif num1 < num2:
#     print(f'{num2} больше')
# else:
#     print(f'Числа равны')

# 1. Проверить число на четность
# 2. Проверить является ли строка пустой
# 3. Проверить является ли строка числом


# Логические операторы
# and, or, not

# and
# True and True = True
# True and False = False
# False and True = False
# False and False = False
# 0 < x < 10
# if x > 0 and x < 10

# or 
# True and True = True
# True and False = True
# False and True = True
# False and False = False
# x < 0...10 < x
# if x < 0 or x > 10

# not 
# not True = False
# not 2 > 5 = True

# Пользователь вводит свой балл по математике. 
# Если он находится в диапазоне от 70 до 100, программа должна вывести 
# "Поздравляем! Вы получили хорошую оценку". 
# Если в диапазоне от 0 до 69, то сообщение "Нужно больше практики"
# Если число не в диапазоне, сказать что введено неверное значение

# Напишите программу, которая запрашивает у пользователя три числа 
# и определяет, какое из них больше
