#include <iostream>
using namespace std;

int main() {
    // === Вывод данных ===
    // cout << значение;
    cout << "Число: " << 20 << '\n';

    // для переноса строки:
        // endl
        // '\n'
    cout << 12512 << endl;
    cout << 2352 << '\n';
    cout << "te\nst \ntex\nt\n";

    // === Ввод данных ===
    // cin >> переменная;
    int num;
    cin >> num;
    cout << "Вы ввели число: " << num << '\n';

    // === Операторы ===
    float num_1, num_2;
    cin >> num_1 >> num_2;

    // --- Математические ---
    cout << "Сложение: " << num_1 << " + " << num_2 << " = " << num_1 + num_2 << '\n';
    cout << "Вычитание: " << num_1 << " - " << num_2 << " = " << num_1 - num_2 << '\n';
    cout << "Умножение: " << num_1 << " * " << num_2 << " = " << num_1 * num_2 << '\n';
    cout << "Деление: " << num_1 << " / " << num_2 << " = " << num_1 / num_2 << '\n';
    cout << "Остаток от деления: " << num_1 << " % " << num_2 << " = " << int(num_1) % int(num_2) << '\n';
    cout << '\n';

    // --- Сравнения ---
    cout << "Больше: " << num_1 << " > " << num_2 << " = " << (num_1 > num_2) << '\n';
    cout << "Меньше: " << num_1 << " < " << num_2 << " = " << (num_1 < num_2) << '\n';
    cout << "Равенство: " << num_1 << " == " << num_2 << " = " << (num_1 == num_2) << '\n';
    cout << "Больше или равно: " << num_1 << " >= " << num_2 << " = " << (num_1 >= num_2) << '\n';
    cout << "Меньше или равно: " << num_1 << " <= " << num_2 << " = " << (num_1 <= num_2) << '\n';
    cout << "Неравенство: " << num_1 << " != " << num_2 << " = " << (num_1 != num_2) << '\n';

    // --- Логические операторы ---

    return 0;
}