#include <iostream> // in out stream (библиотека ввода/вывода)
using namespace std; // использование категории std

// Главная функция программы
int main() {
    // === 1. Переменные ===
    // тип_данных имя = значение;
    int num = 125;

    // --- Типы данных ---
    // 1. int - целые числа
    int number = 4368;

    // 2. float - дроби
    float shell = 12.86;

    // 3. double - дроби большего размера
    double shell_2 = 23415.646584;

    // 4. char - 1 символ (одинарные кавычки)
    char symb = 'E';

    // 5. string - строки (двойные кавычки)
    string str = "Привет, бичпачмак?%:(2849632";

    // 6. bool - логический (true / false)
    bool is_weekend = false;

    // Принципы именования переменных
    // getdatafromtable
    // 1. Camel Case -> getDataFromTable
    // 2. Underscore Case -> get_data_from_table

    // Вывод в консоль
    // cout << значение;

    // Перенос строки
    // 1. endl
    // 2. '\n'
    cout << str << endl;
    cout << shell << '\n';
    cout << "sosok\n";

    cout << "Пример числа int: " << num << '\n';

    // Задача 1:
    //   Создать переменные для персонажа игры:
    // - имя (string)
    // - уровень (int)
    // - здоровье (float)
    // - активен ли (bool)
    // - класс персонажа одним символом (char)
    //
    // Вывести все данные красиво на экран



//   Создать переменные для описания товара в магазине:
// - название
// - цена
// - количество на складе
// - есть ли в наличии
//
// Вывести все на экран

}
