#include <iostream>
using namespace std;

int main() {
    // === Ввод данных ===
    // cin >> переменная;

    int x; // создание пустой переменной
    cin >> x; // ввод значения для переменной x
    cout << "Вы ввели число: " << x << '\n';

    // === Операторы ===
    float num_1, num_2;
    cin >> num_1 >> num_2;

    // --- Математические ---
    cout << "Сложение: " << num_1 << " + " << num_2 << " = " << num_1 + num_2 << '\n';
    cout << "Вычитание: " << num_1 << " - " << num_2 << " = " << num_1 - num_2 << '\n';
    cout << "Умножение: " << num_1 << " * " << num_2 << " = " << num_1 * num_2 << '\n';
    cout << "Деление: " << num_1 << " / " << num_2 << " = " << num_1 / num_2 << '\n';
    cout << "Остаток от деления: " << num_1 << " % " << num_2 << " = " << int(num_1) % int(num_2) << '\n';
    cout << '\n';

    // --- Сравнения ---
    cout << "Больше: " << num_1 << " > " << num_2 << " = " << (num_1 > num_2) << '\n';
    cout << "Меньше: " << num_1 << " < " << num_2 << " = " << (num_1 < num_2) << '\n';
    cout << "Равенство: " << num_1 << " == " << num_2 << " = " << (num_1 == num_2) << '\n';
    cout << "Больше или равно: " << num_1 << " >= " << num_2 << " = " << (num_1 >= num_2) << '\n';
    cout << "Меньше или равно: " << num_1 << " <= " << num_2 << " = " << (num_1 <= num_2) << '\n';
    cout << "Неравенство: " << num_1 << " != " << num_2 << " = " << (num_1 != num_2) << '\n';

    return 0;
}