import numpy as np

# === Индексация линейных массивов ===
arr = np.array([10, 20, 30, 40, 50, 60, 70, 80, 90, 100])

# индексация линейных массивов
print(arr[3]) # слева направо
print(arr[-1]) # в обратную сторону

# fancy indexing - индексация по списку индексов
indices = [0, 4, 6, 8]
print('fancy: ', arr[indices])

# изменение значений разными способами
arr[0] = 100 # через индекс
arr[1:4] = [200, 300, 400] # через срез
arr[[4, 5, 6]] = [500, 600, 700] # через fancy
arr[[7, 8, 9]] = 5 # фиксированное число через fancy
print('Refactor: ', arr)

# Срезы
# [start:end-1:step]
print(arr[2:]) # от 2 индекса до конца
print(arr[2:7]) # от 2 до 6 индекса
print(arr[::2]) # каждый 2ой элемент, начиная с первого


# === Индексация матриц ===
matrix = np.array([
    [1, 2, 3],
    [4, 5, 6],
    [7, 8, 9]
])

print(matrix[0][1]) # через списки python
print(matrix[0, 1]) # через numpy [строка, столбец]

# срезы матриц
print('срезы матриц:')
print(matrix[0]) # первая строка
print(matrix[1, :2]) # вторая строка, все значения кроме последнего
print(matrix[:2, 0]) # 1, 2 строки, все значения под индексом 0

np.random.seed(1)
randint_arr = np.random.randint(1, 100, (10, 10))
print('Тест срезов:\n', randint_arr)
print('\nПосле среза:\n', randint_arr[2:8, 4:6]) # c 3 до 8 строки, с 5 до 6 столбика

# === Маски ===
