import numpy as np

# Broadcast - растягивание массива
# 1. Массив + скаляр (одиночное значение)
arr = np.array([1, 2, 3, 4, 5])
print(arr + 10) # [11 12 13 14 15]

# 2. Матрица + вектор
matrix = np.array([
    [1, 2, 3],
    [4, 5, 6],
    [7, 8, 9]
])
vector = np.array([10, 20, 30])
print(matrix + vector)
# [[11 22 33]
#  [14 25 36]
#  [17 28 39]]

# 3. Столбцы + строки
col = np.array([
    [1],
    [2],
    [3],
    [4],
    [5]
])
row = np.array([10, 20, 30])
print(col + row)
# [[11 21 31]
#  [12 22 32]
#  [13 23 33]
#  [14 24 34]
#  [15 25 35]]