# Стандартная работа с функциями
# def hello():
#     print('hello!')

# hello() # стандартный вызов функции

# greetings = hello # используем instance функции
# greetings()

# def testFunc(func): # используем instance функции в качестве аргумента
#     func()

# testFunc(hello)

# # Функции внутри функции
# def outerFunc(): # создаем внешнюю функцию
#     print('Это внешнаяя ф-ция')

#     def innerFunc(): # внутри внешней создаем внутреннюю функцию
#         print('Это внутреннаяя ф-ция')

#     innerFunc() # вызываем внутреннюю функцию

#     print('Внешняя ф-ция завершена') # завершаем выполнение внешней 

# outerFunc()

# Подводка к декоратору
# Декоратор - это функция, которая принимает функцию в качестве аргумента и возвращает новую функцию
def makeNice(func):
    def wrapper():
        print('=============')
        func()
        print('=============')
    
    return wrapper

# Ручной способ
# def hello():
#     print('hello!')

# wrapperFunc = makeNice(hello)
# wrapperFunc()

# Способ с использованием декоратора
@makeNice
def hello():
    print('hello!')

hello()

# Декоратор с аргументами
def addEmoji(func):
    def wrapper(arg):
        return f'🥱 {func(arg)} 😴'

    return wrapper
        
@addEmoji
def goSleep(name):
    return f'{name}, пора спать'

print(goSleep('Вася'))

# Универсальный декоратор
def smartDecor(func):
    # *arg - позиционные аргументы (как значения массива)
    # **kwarg - ключевые аргументы (как ключ и значение в словаре)
    def wrapper(*arg, **kwarg):
        print(f'вызвана фнукция {func.__name__}') # получаем название ф-ции
        print(f'аргументы: {arg}')                # выводим все позиционные аргументы
        print(f'ключевые аргументы: {kwarg}')     # выводим все ключевые аргументы

        result = func(*arg, **kwarg)              # выполняем исходную ф-цию
        print(f'Результат работы функции: {result}')
        print('------------\n')

    return wrapper

@smartDecor
def sum(a, b):
    return a + b

sum(12, 45)


@smartDecor
def sayHello(name, greet = 'Привет'):
    return f'{greet}, {name}'

sayHello('Bob', 'Hi')
sayHello('Robert', greet = 'Hey')
sayHello('додик')


# 1. Декоратор проверки возраста
def checkAge(func):
    def wrapper(age):
        if age < 18:
            return 'Вы слишком молоды, проход закрыт'
        else:
            return func(age)
        
    return wrapper
@checkAge
def enterBar(age):
    return f'Вам {age} лет, вы можете пройти'

print(enterBar(20))


# @makeBig
# def small(string):
#     return string

# 'привет'
# '!!!ПРИВЕТ!!!'
# str.upper()