#include <iostream>
using namespace std;

int main() {
    // === Ввод данных ===
    int num; // инициализация пустой переменной
    cout << "Введите число: " << '\n';
    cin >> num; // ввод значения для переменной num

    cout << "Вы ввели число: " << num << '\n';

    // === Операторы ===
    float num_1, num_2;

    cout << "Введите два числа: \n";
    cin >> num_1 >> num_2;

    // --- Математические операторы ---
    cout << "Сумма " << num_1 << " + " << num_2 << " = " << num_1 + num_2 << '\n';
    cout << "Разность " << num_1 << " - " << num_2 << " = " << num_1 - num_2 << '\n';
    cout << "Произведение " << num_1 << " * " << num_2 << " = " << num_1 * num_2 << '\n';
    cout << "Частное " << num_1 << " / " << num_2 << " = " << num_1 / num_2 << '\n';
    cout << "Остаток от деления " << num_1 << " % " << num_2 << " = " << int(num_1) % int(num_2) << '\n';
    // int(num_1) - преобразование переменной num типа float в тип int

    // --- Операторы сравнения ---
    cout << "\nРавенство " << num_1 << " == " << num_2 << " = " << (num_1 == num_2) << '\n';
    cout << "Неравенство " << num_1 << " != " << num_2 << " = " << (num_1 != num_2) << '\n';
    cout << "Больше " << num_1 << " > " << num_2 << " = " << (num_1 > num_2) << '\n';
    cout << "Меньше " << num_1 << " < " << num_2 << " = " << (num_1 < num_2) << '\n';
    cout << "Больше или равно " << num_1 << " >= " << num_2 << " = " << (num_1 >= num_2) << '\n';
    cout << "Меньше или равно " << num_1 << " <= " << num_2 << " = " << (num_1 <= num_2) << '\n';

    // --- Логические операторы ---
    // И (&&)
    // если хотя бы одно выражение false - результат false
    cout << ((2 > 5) && (8 < 19)) << '\n'; // false

    // ИЛИ (||)
    // если хотя бы одно выражение true - результат true
    cout << ((2 > 5) || (8 < 19)) << '\n'; // true

    // НЕ (!)
    // переворачивает значение на противоположное (!true = false)
    cout << !(2 > 5) << '\n'; // true

    return 0;
}

